### 切配菜品---数值操作

#### 数值替换

一对一替换：就是将某一区域中的一个值全部替换成另外一个值
在python中对某个值进行替换利用的是 replace()方法，replace(A,B),表示将A替换成B
df["年龄"].replace(240,35,inplace=True)

In [1]:
import pandas as pd
import numpy as np
df2=pd.read_table(r".\file\test.txt",sep=" ",encoding="utf-8")
df2

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38    102  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0
3   A2   李四  46    102  2019-02-03   NaN

In [2]:
df2["唯一识别码"].replace(102,1002,inplace=True)
df2

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   NaN

有时候需要对整个表进行替换，比如对全表中的缺失值进行替换，这个时候replace方法相当于fillna()方法；
np.NaN是python中对缺失值的一种表示方法

In [3]:
df2.replace(np.NaN,0)   # 因为没有 为 NaN 的值所以替换不了

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   0.0

多对一的替换：把一块区域中的多个值替换成某一个值，eg:把年龄的3个异常值（240,260,280），替换成正常值的平均值 33
采用replace([A,B],C)表示 将 A，B 替换成 C

In [4]:
df2.replace([101,105],1004)

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50   1004  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29   1004  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   NaN

多对多的替换：就是将某个区域中多个一对一的替换。
采用的方法是：replace({"A":"a","B":"b"}) 用a替换A,用b替换B

In [5]:
df2.replace({101:1001,102:1002,105:1005})

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50   1001  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29   1005  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   NaN

#### 数值的排序

按照一列数值进行排序：
  就是将整个数据表都以某一列为准，进行升序或降序排序。
  采用的方法是：sort_values()方法，在此函数中要指明sort_values后的括号中指明要排序的列名，以及升序或者降序
  df.sort_values(by=["coll"],ascending=False)
  表示df表按照coll列进行排序，ascending=False表示按照coll列进行降序排序，ascending参数默认是Ture,表示升序

In [6]:
df2.sort_values(by=["订单编号"])

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
3   A2   李四  46   1002  2019-02-03   NaN
2   A3   王五  29    105  2019-03-01   6.0

In [7]:
df2.sort_values(by=["唯一识别码"],ascending=False)

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
1   A2   李四  38   1002  2019-02-03   4.0
3   A2   李四  46   1002  2019-02-03   NaN
2   A3   王五  29    105  2019-03-01   6.0
0   A1   张三  50    101  2019-01-02   1.0

按照有缺失值的列进行排序：
  在python中，当待排序的列中有缺失值时，可以通过设置na_position参数对缺失值的显示位置进行设置，默认参数值为last，可以不写，表示将缺失值显示在最后面。

In [8]:
df2.sort_values(by=["销售id"])

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   NaN

In [9]:
df2.sort_values(by=["销售id"],na_position="first")

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
3   A2   李四  46   1002  2019-02-03   NaN
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0

按照多列数值进行排序：
 是指同时依据多列数据进行升序、降序排列，当第一列出现重复值时按照第二列进行排序，当第二列出现重复值时按照第三列进行排序，依次类推：
 df.sort_values(by=["col1","col2"],ascending=[True,False])

In [10]:
df2.sort_values(by=["唯一识别码","销售id"],ascending=[False,True])

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
1   A2   李四  38   1002  2019-02-03   4.0
3   A2   李四  46   1002  2019-02-03   NaN
2   A3   王五  29    105  2019-03-01   6.0
0   A1   张三  50    101  2019-01-02   1.0

#### 数值排名

数值排序和数值排名是想对应的，排名会新增一列，这一列用来存放数据的排名情况，排名是从1开始的。
  在python 中 使用 rank()方法。rank()主要有2个参数，一个是ascending用来指明升序排序还是降序排序，默认为升序。
  另外一个是 method，用来指明待排序值有重复值时的处理情况。
  method下的不同参数：average:返回重复值的平均排名；first:按值在所有的代排列数据中出现的先后顺序排名；
      min：返回重复值的最佳排名；
      max:取重复值对应的最大排名；

In [11]:
df2["唯一识别码"].rank(method="average")

0    1.0
1    3.5
2    2.0
3    3.5
Name: 唯一识别码, dtype: float64

In [12]:
df2["唯一识别码"].rank(method="first")

0    1.0
1    3.0
2    2.0
3    4.0
Name: 唯一识别码, dtype: float64

In [13]:
df2

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   NaN

#### 数值删除

数值删除就是对数据表中一些无用的数据进行删除操作
在python 中药删除某一列，用的方法是 drop()方法，即在drop方法后的括号中指明要删除的列名或者列的位置，即第几列；
在drop方法后的括号中直接传入待删除的列名，需要加一个参数 axis,并让其参数值等于 1,表示删除列；

In [14]:
df2.drop(["销售id"],axis=1)

  订单编号 客户姓名  年龄  唯一识别码        成交时间
0   A1   张三  50    101  2019-01-02
1   A2   李四  38   1002  2019-02-03
2   A3   王五  29    105  2019-03-01
3   A2   李四  46   1002  2019-02-03

In [15]:
df2.drop(df2.columns[[3,4]],axis=1)

  订单编号 客户姓名  年龄  销售id
0   A1   张三  50   1.0
1   A2   李四  38   4.0
2   A3   王五  29   6.0
3   A2   李四  46   NaN

In [16]:
df2.drop(columns=["销售id","成交时间"])

  订单编号 客户姓名  年龄  唯一识别码
0   A1   张三  50    101
1   A2   李四  38   1002
2   A3   王五  29    105
3   A2   李四  46   1002

删除行：用到的方法是 drop(),删除行也要指明行的相关信息；
drop中直接传入行名，并让axis参数值等于0，表示删除行

In [17]:
df2.drop(df2.index[[0,1]],axis=0)

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
2   A3   王五  29    105  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   NaN

In [18]:
df2.drop(index=[2,3])  # 直接把行名传过来。如果行是字符串 则需要这样 index=["a","b"]

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0

删除特定行：指删除满足条件的某行，比如前面说的异常值的删除算是删除特定的行。
但在python 中不直接删除满足条件的值，而是把不满足条件的值给筛选出来作为新的数据源，这样就把要删除的 行给过滤掉 了、
例如要删除年龄值大于等于40对应的行，并不直接删除，而是取相反的部分取出来，即把年龄小于40的行筛选出来作为新的数据源；

In [19]:
df2[df2["年龄"]<40]

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0

#### 数值计数

数值计数就是计算某个值在一系列数值中出现的次数：在python中使用的方法是value_counts()

In [20]:
df2["唯一识别码"].value_counts()  # 这些是值出现的 绝对次数

1002    2
105     1
101     1
Name: 唯一识别码, dtype: int64

In [21]:
df2["唯一识别码"].value_counts(normalize=True)   # 传入参数看不同值出现的 占比；

1002    0.50
105     0.25
101     0.25
Name: 唯一识别码, dtype: float64

In [22]:
df2["唯一识别码"].value_counts(normalize=True,sort=False)  # sort=False实现不按计数值降序排列

101     0.25
1002    0.50
105     0.25
Name: 唯一识别码, dtype: float64

#### 唯一值获取

唯一值获取就是把一系列值删除重复项以后的结果，一般可以将表中某一列认为是一系列值。
使用unique()实现来获取唯一值

In [23]:
df2["唯一识别码"].unique()

array([ 101, 1002,  105], dtype=int64)

#### 数值的查找

数值的查找就是查看数据表中的数据是否包含某个值或者某些值
在python中，则是使用isin()方法，而且可以同时查找多个值，只需要在isin方法后的括号中指明即可。
  可以将某列数据提取出来，然后在这一列上调用isin()方法，看这一列中是否包含某个/些值，如果包含则返回True,否则返回False

In [24]:
df2

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   NaN

In [25]:
df2["年龄"].isin([38,29])

0    False
1     True
2     True
3    False
Name: 年龄, dtype: bool

In [26]:
df2.isin(["A2",29])

    订单编号   客户姓名     年龄  唯一识别码   成交时间   销售id
0  False  False  False  False  False  False
1   True  False  False  False  False  False
2  False  False   True  False  False  False
3   True  False  False  False  False  False

#### 区间切分

就是将一系列数值分成若干份。
在python中对区间切分利用的是 cut()方法，cut()方法有一个参数bins用来指明切分区间；
cut()方法切分的是左开右闭的区间（0，3]

In [27]:
df2

  订单编号 客户姓名  年龄  唯一识别码        成交时间  销售id
0   A1   张三  50    101  2019-01-02   1.0
1   A2   李四  38   1002  2019-02-03   4.0
2   A3   王五  29    105  2019-03-01   6.0
3   A2   李四  46   1002  2019-02-03   NaN

In [29]:
pd.cut(df2['年龄'],bins=[20,30,40,50,60])

0    (40, 50]
1    (30, 40]
2    (20, 30]
3    (40, 50]
Name: 年龄, dtype: category
Categories (4, interval[int64]): [(20, 30] < (30, 40] < (40, 50] < (50, 60]]

qcut()方法不需要事前指明切分区间，只需要指明切分个数--依据的原则就是每个组里面的数据个数尽可能相等

In [30]:
pd.qcut(df2["年龄"],3)

0      (46.0, 50.0]
1    (28.999, 38.0]
2    (28.999, 38.0]
3      (38.0, 46.0]
Name: 年龄, dtype: category
Categories (3, interval[float64]): [(28.999, 38.0] < (38.0, 46.0] < (46.0, 50.0]]

#### 插入新的行或列

在python中插入新的列用的方法是insert()方法，在其指出要插入的位置，插入新列的列名，以及要插入的数据

In [31]:
df2.insert(2,"商品类别",["cat01","cat02","cat03","cat04"])
df2

  订单编号 客户姓名   商品类别  年龄  唯一识别码        成交时间  销售id
0   A1   张三  cat01  50    101  2019-01-02   1.0
1   A2   李四  cat02  38   1002  2019-02-03   4.0
2   A3   王五  cat03  29    105  2019-03-01   6.0
3   A2   李四  cat04  46   1002  2019-02-03   NaN

#### 行列互换

直接在源数据表的基础上调用 .T 方法即可得到源数据表转置后的结果

In [32]:
df2.T

                0           1           2           3
订单编号           A1          A2          A3          A2
客户姓名           张三          李四          王五          李四
商品类别        cat01       cat02       cat03       cat04
年龄             50          38          29          46
唯一识别码         101        1002         105        1002
成交时间   2019-01-02  2019-02-03  2019-03-01  2019-02-03
销售id            1           4           6         NaN

In [33]:
df2.T.T

  订单编号 客户姓名   商品类别  年龄 唯一识别码        成交时间 销售id
0   A1   张三  cat01  50   101  2019-01-02    1
1   A2   李四  cat02  38  1002  2019-02-03    4
2   A3   王五  cat03  29   105  2019-03-01    6
3   A2   李四  cat04  46  1002  2019-02-03  NaN

#### 索引重塑

把数据从表格型数据转换到树形数据的过程叫重塑；
使用的方法是 stack()

In [34]:
df2.stack()

0  订单编号             A1
   客户姓名             张三
   商品类别          cat01
   年龄               50
   唯一识别码           101
   成交时间     2019-01-02
   销售id              1
1  订单编号             A2
   客户姓名             李四
   商品类别          cat02
   年龄               38
   唯一识别码          1002
   成交时间     2019-02-03
   销售id              4
2  订单编号             A3
   客户姓名             王五
   商品类别          cat03
   年龄               29
   唯一识别码           105
   成交时间     2019-03-01
   销售id              6
3  订单编号             A2
   客户姓名             李四
   商品类别          cat04
   年龄               46
   唯一识别码          1002
   成交时间     2019-02-03
dtype: object

In [35]:
df2.stack().unstack()

  订单编号 客户姓名   商品类别  年龄 唯一识别码        成交时间 销售id
0   A1   张三  cat01  50   101  2019-01-02    1
1   A2   李四  cat02  38  1002  2019-02-03    4
2   A3   王五  cat03  29   105  2019-03-01    6
3   A2   李四  cat04  46  1002  2019-02-03  NaN

#### 长宽表转换

长宽表转换就是将比较长（很多行）的表转换为比较宽（很多列）的表；
宽表转换为长表：stack()方法，另一种是melt()方法
stack()将表格型数据转换为树形数据时，是保持行索引不变的前提下，将列索引变为行索引。

In [36]:
df2.set_index(["订单编号","客户姓名"])  # 先设置成索引

            商品类别  年龄  唯一识别码        成交时间  销售id
订单编号 客户姓名
A1   张三    cat01  50    101  2019-01-02   1.0
A2   李四    cat02  38   1002  2019-02-03   4.0
A3   王五    cat03  29    105  2019-03-01   6.0
A2   李四    cat04  46   1002  2019-02-03   NaN

In [39]:
df2.set_index(["订单编号","客户姓名"]) .stack()

订单编号  客户姓名
A1    张三    商品类别          cat01
            年龄               50
            唯一识别码           101
            成交时间     2019-01-02
            销售id              1
A2    李四    商品类别          cat02
            年龄               38
            唯一识别码          1002
            成交时间     2019-02-03
            销售id              4
A3    王五    商品类别          cat03
            年龄               29
            唯一识别码           105
            成交时间     2019-03-01
            销售id              6
A2    李四    商品类别          cat04
            年龄               46
            唯一识别码          1002
            成交时间     2019-02-03
dtype: object

In [40]:
# melt()方法实现
df2.melt(id_vars=["订单编号","客户姓名"])

   订单编号 客户姓名 variable       value
0    A1   张三     商品类别       cat01
1    A2   李四     商品类别       cat02
2    A3   王五     商品类别       cat03
3    A2   李四     商品类别       cat04
4    A1   张三       年龄          50
5    A2   李四       年龄          38
6    A3   王五       年龄          29
7    A2   李四       年龄          46
8    A1   张三    唯一识别码         101
9    A2   李四    唯一识别码        1002
10   A3   王五    唯一识别码         105
11   A2   李四    唯一识别码        1002
12   A1   张三     成交时间  2019-01-02
13   A2   李四     成交时间  2019-02-03
14   A3   王五     成交时间  2019-03-01
15   A2   李四     成交时间  2019-02-03
16   A1   张三     销售id           1
17   A2   李四     销售id           4
18   A3   王五     销售id           6
19   A2   李四     销售id         NaN

长表转换为宽表

In [43]:
df2.pivot_table(index=["订单编号","客户姓名"])

           唯一识别码  年龄  销售id
订单编号 客户姓名
A1   张三      101  50   1.0
A2   李四     1002  42   4.0
A3   王五      105  29   6.0

  订单编号 客户姓名   商品类别  年龄  唯一识别码        成交时间  销售id
0   A1   张三  cat01  50    101  2019-01-02   1.0
1   A2   李四  cat02  38   1002  2019-02-03   4.0
2   A3   王五  cat03  29    105  2019-03-01   6.0
3   A2   李四  cat04  46   1002  2019-02-03   NaN

#### apply()与applymap()函数

map()函数是对一个序列中的所有元素执行相同的函数操作；
apply()和applymap()都需要与匿名函数lambda结合使用
apply()函数主要用于对DataFrame中的某一column或row中的元素执行相同的函数操作

In [50]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["c1","c2","c3"])
df

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9

In [51]:
df["c1"].apply(lambda x:x+1)

0    2
1    5
2    8
Name: c1, dtype: int64

In [52]:
df.applymap(lambda x:x+1)

   c1  c2  c3
0   2   3   4
1   5   6   7
2   8   9  10